---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryXRotationSpring
source: html/b65c3100-f851-3838-8da5-e6048e68055b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryXRotationSpring Property

"X Rotation - Spring"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryXRotationSpring { get; }
```